---
kind: method
id: M:Autodesk.Revit.DB.Structure.StructuralConnectionHandler.IsCustom
source: html/f0a922df-ec34-9170-0963-86edc9243628.htm
---
# Autodesk.Revit.DB.Structure.StructuralConnectionHandler.IsCustom Method

Checks if Structural Connection Handler has the custom connection style.

## Syntax (C#)
```csharp
public bool IsCustom()
```

## Returns
True if Structural Connection Handler has the custom connection style.